# По данному целому числу N распечатайте все квадраты натуральных чисел, не превосходящие N, в порядке возрастания.

# Например:
# 50      1 4 9 16 25 36 49
# 10      1 4 9
# 9       1 4 9
# 4       1 4
# 1       1
# 100     1 4 9 16 25 36 49 64 81 100
# 99      1 4 9 16 25 36 49 64 81

inp = int(input('Введите число: '))
square = 1
a = 1
print ('Искомые квадраты: ', end = ' ')
while square <= inp:
    # print ('a = ' + str(a))
    # print ('square = ' + str(square))
    a += 1
    print((square), end = ' ')    
    square = pow(a,2)    
    